adamkondraciuk/hal_nordic/nrfx/mdk/nrf5001.h
/*
 * Copyright (c) 2010 - 2020, Nordic Semiconductor ASAAll rights reserved.Redistribution and use in sou
 * rce and binary forms, with or without modification,are permitted provided that the following conditi
 * ons are met:1. Redistributions of source code must retain the above copyright notice, this list of c
 * onditions and the following disclaimer.2. Redistributions in binary form, except as embedded into a 
 * Nordic Semiconductor ASA integrated circuit in a product or a software update for such product, must
 * reproduce the above copyright notice, this list of conditions and the following disclaimer in the d
 * ocumentation and/or other materials provided with the distribution.3. Neither the name of Nordic Sem
 * iconductor ASA nor the names of its contributors may be used to endorse or promote products derived 
 * from this software without specific prior written permission.4. This software, with or without modif
 * ication, must only be used with a Nordic Semiconductor ASA integrated circuit.5. Any software provid
 * ed in binary form under this license must not be reverse engineered, decompiled, modified and/or dis
 * assembled.THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESSOR IMPLIED WA
 * RRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIESOF MERCHANTABILITY, NONINFRINGEMENT, 
 * AND FITNESS FOR A PARTICULAR PURPOSE AREDISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CO
 * NTRIBUTORS BELIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, ORCONSEQUENTIAL DAMAGE
 * S (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTEGOODS OR SERVICES; LOSS OF USE, DATA, OR 
 * PROFITS; OR BUSINESS INTERRUPTION)HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT
 * , STRICTLIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUTOF THE USE OF T
 * HIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 * @file     nrf5001.h
 * @brief    CMSIS HeaderFile
 * @version  1
 * @date     14. August 2020
 * @note     Generated by SVDConv V3.3.35 on Friday, 14.08.2020 15:11:29
 *           from File 'nrf5001.svd',
 *           last modified on Friday, 14.08.2020 13:11:17
 */



/** @addtogroup Nordic Semiconductor
  * @{
  */


/** @addtogroup nrf5001
  * @{
  */


#ifndef NRF5001_H
#define NRF5001_H

#ifdef __cplusplus
extern "C" {
#endif


/** @addtogroup Configuration_of_CMSIS
  * @{
  */



/* =========================================================================================================================== */
/* ================                                Interrupt Number Definition                                ================ */
/* =========================================================================================================================== */

typedef enum {
/* =======================================  ARM Cortex-M0 Specific Interrupt Numbers  ======================================== */
  Reset_IRQn                = -15,              /*!< -15  Reset Vector, invoked on Power up and warm reset                     */
  NonMaskableInt_IRQn       = -14,              /*!< -14  Non maskable Interrupt, cannot be stopped or preempted               */
  HardFault_IRQn            = -13,              /*!< -13  Hard Fault, all classes of Fault                                     */
  SVCall_IRQn               =  -5,              /*!< -5 System Service Call via SVC instruction                                */
  PendSV_IRQn               =  -2,              /*!< -2 Pendable request for system service                                    */
  SysTick_IRQn              =  -1,              /*!< -1 System Tick Timer                                                      */
/* ==========================================  nrf5001 Specific Interrupt Numbers  =========================================== */
  CLOCK_POWER_IRQn          =   0,              /*!< 0  CLOCK_POWER                                                            */
  RADIO_IRQn                =   2,              /*!< 2  RADIO                                                                  */
  RNG_IRQn                  =   3,              /*!< 3  RNG                                                                    */
  GPIOTE_IRQn               =   4,              /*!< 4  GPIOTE                                                                 */
  WDT_IRQn                  =   5,              /*!< 5  WDT                                                                    */
  TIMER0_IRQn               =   6,              /*!< 6  TIMER0                                                                 */
  TIMER1_IRQn               =   7,              /*!< 7  TIMER1                                                                 */
  ECB_IRQn                  =   9,              /*!< 9  ECB                                                                    */
  AAR_CCM_IRQn              =  10,              /*!< 10 AAR_CCM                                                                */
  RTC0_IRQn                 =  12,              /*!< 12 RTC0                                                                   */
  RTC1_IRQn                 =  13,              /*!< 13 RTC1                                                                   */
  SPIM0_SPIS0_UARTE0_IRQn   =  14,              /*!< 14 SPIM0_SPIS0_UARTE0                                                     */
  USBD_IRQn                 =  17,              /*!< 17 USBD                                                                   */
  QDEC0_IRQn                =  18               /*!< 18 QDEC0                                                                  */
} IRQn_Type;



/* =========================================================================================================================== */
/* ================                           Processor and Core Peripheral Section                           ================ */
/* =========================================================================================================================== */

/* ===========================  Configuration of the ARM Cortex-M0 Processor and Core Peripherals  =========================== */
#define __CM0_REV                 0x0004U       /*!< CM0 Core Revision                                                         */
#define __DSP_PRESENT                  0        /*!< DSP present or not                                                        */
#define __VTOR_PRESENT                 0        /*!< Set to 1 if CPU supports Vector Table Offset Register                     */
#define __NVIC_PRIO_BITS               2        /*!< Number of Bits used for Priority Levels                                   */
#define __Vendor_SysTickConfig         0        /*!< Set to 1 if different SysTick Config is used                              */
#define __MPU_PRESENT                  0        /*!< MPU present                                                               */
#define __FPU_PRESENT                  0        /*!< FPU present                                                               */
#define __SAUREGION_PRESENT            0        /*!< SAU region present                                                        */


/** @} */ /* End of group Configuration_of_CMSIS */

#include "core_cm0.h"                           /*!< ARM Cortex-M0 processor and core peripherals                              */
#include "system_nrf5001.h"                     /*!< nrf5001 System                                                            */

#ifndef __IM                                    /*!< Fallback for older CMSIS versions                                         */
  #define __IM   __I
#endif
#ifndef __OM                                    /*!< Fallback for older CMSIS versions                                         */
  #define __OM   __O
#endif
#ifndef __IOM                                   /*!< Fallback for older CMSIS versions                                         */
  #define __IOM  __IO
#endif


/* =========================================================================================================================== */
/* ================                              Device Specific Cluster Section                              ================ */
/* =========================================================================================================================== */


/** @addtogroup Device_Peripheral_clusters
  * @{
  */


/**
  * @brief FICR_SOCINFO [SOCINFO] (Unspecified)
  */
typedef struct {
  __IM  uint32_t  PARTNO;                       /*!< (@ 0x00000000) Part number of the device.                                 */
  __IM  uint32_t  HWREVISION;                   /*!< (@ 0x00000004) Hardware Revision of the device. Will be updated
                                                                    in production test.                                        */
  __IM  uint32_t  PRODUCTIONREVISION;           /*!< (@ 0x00000008) Production revision of the device. Will be updated
                                                                    in production test.                                        */
} FICR_SOCINFO_Type;                            /*!< Size = 12 (0xc)                                                           */


/**
  * @brief FICR_INFO [INFO] (Device info)
  */
typedef struct {
  __IM  uint32_t  CONFIGID;                     /*!< (@ 0x00000000) Configuration identifier                                   */
  __IM  uint32_t  DEVICEID[2];                  /*!< (@ 0x00000004) Description collection: Device identifier                  */
  __IM  uint32_t  PART;                         /*!< (@ 0x0000000C) Part code                                                  */
  __IM  uint32_t  VARIANT;                      /*!< (@ 0x00000010) Part Variant, Hardware version and Production
                                                                    configuration                                              */
  __IM  uint32_t  PACKAGE;                      /*!< (@ 0x00000014) Package option                                             */
  __IM  uint32_t  RAM;                          /*!< (@ 0x00000018) RAM variant                                                */
  __IM  uint32_t  MTP;                          /*!< (@ 0x0000001C) MTP variant                                                */
  __IM  uint32_t  CODEPAGESIZE;                 /*!< (@ 0x00000020) Code memory page size in bytes                             */
  __IM  uint32_t  CODESIZE;                     /*!< (@ 0x00000024) Code memory size                                           */
  __IM  uint32_t  DEVICETYPE;                   /*!< (@ 0x00000028) Device type                                                */
} FICR_INFO_Type;                               /*!< Size = 44 (0x2c)                                                          */


/**
  * @brief PAMLI_RAMPRI [RAMPRI] (RAM configurable priority configuration structure)
  */
typedef struct {
  __IOM uint32_t  SERIAL0;                      /*!< (@ 0x00000000) AHB bus master priority register for SPIM0, SPIS0,
                                                                    TWIM0, TWIS0 and UARTE0                                    */
  __IM  uint32_t  RESERVED[2];
  __IOM uint32_t  RADIO;                        /*!< (@ 0x0000000C) AHB bus master priority register for RADIO                 */
  __IOM uint32_t  ECB;                          /*!< (@ 0x00000010) AHB bus master priority register for ECB                   */
  __IOM uint32_t  CCM;                          /*!< (@ 0x00000014) AHB bus master priority register for CCM                   */
  __IOM uint32_t  AAR;                          /*!< (@ 0x00000018) AHB bus master priority register for AAR                   */
} PAMLI_RAMPRI_Type;                            /*!< Size = 28 (0x1c)                                                          */


/**
  * @brief VMC_RAM [RAM] (Unspecified)
  */
typedef struct {
  __IOM uint32_t  POWER;                        /*!< (@ 0x00000000) Description cluster: RAM[n] power control register         */
  __IOM uint32_t  POWERSET;                     /*!< (@ 0x00000004) Description cluster: RAM[n] power control set
                                                                    register                                                   */
  __IOM uint32_t  POWERCLR;                     /*!< (@ 0x00000008) Description cluster: RAM[n] power control clear
                                                                    register                                                   */
  __IM  uint32_t  RESERVED;
} VMC_RAM_Type;                                 /*!< Size = 16 (0x10)                                                          */


/**
  * @brief RAMBIST_STATUS [STATUS] (Unspecified)
  */
typedef struct {
  __IM  uint32_t  BIST;                         /*!< (@ 0x00000000) Status of the BIST                                         */
  __IM  uint32_t  FAULTY;                       /*!< (@ 0x00000004) Which blocks are failing the test                          */
} RAMBIST_STATUS_Type;                          /*!< Size = 8 (0x8)                                                            */


/**
  * @brief RAMBIST_CONFIG [CONFIG] (Unspecified)
  */
typedef struct {
  __IOM uint32_t  RAMBIST;                      /*!< (@ 0x00000000) Configuration of the RamBist itself. When none
                                                                    of the fields are set, it runs the standard
                                                                    production test BIST.                                      */
  __IOM uint32_t  RAM;                          /*!< (@ 0x00000004) Override of the RAM configuration                          */
  __IOM uint32_t  CLAMP;                        /*!< (@ 0x00000008) Clamp/Exclude certain blocks from the test                 */
} RAMBIST_CONFIG_Type;                          /*!< Size = 12 (0xc)                                                           */


/**
  * @brief AMLI_RAMPRI [RAMPRI] (RAM configurable priority configuration structure)
  */
typedef struct {
  __IOM uint32_t  CPU;                          /*!< (@ 0x00000000) AHB bus master priority register for CPU                   */
  __IOM uint32_t  PERI;                         /*!< (@ 0x00000004) AHB bus master priority register for periperals            */
  __IOM uint32_t  USB;                          /*!< (@ 0x00000008) AHB bus master priority register for USB                   */
  __IOM uint32_t  CTRLAP;                       /*!< (@ 0x0000000C) AHB bus master priority register for CTRL-AP               */
} AMLI_RAMPRI_Type;                             /*!< Size = 16 (0x10)                                                          */


/**
  * @brief GPIO_PIN [PIN] (Pin n direct access)
  */
typedef struct {
  __IOM uint32_t  OUT;                          /*!< (@ 0x00000000) Description cluster: Pin n direct access output
                                                                    register                                                   */
  __IOM uint32_t  IN;                           /*!< (@ 0x00000004) Description cluster: Pin n direct access input
                                                                    register                                                   */
} GPIO_PIN_Type;                                /*!< Size = 8 (0x8)                                                            */


/**
  * @brief OSCILLATORS_PLL64M [PLL64M] (Unspecified)
  */
typedef struct {
  __IOM uint32_t  BYPASS;                       /*!< (@ 0x00000000) PLL64M bypass control                                      */
  __IOM uint32_t  MUTE;                         /*!< (@ 0x00000004) Mute the PLL64M                                            */
  __IOM uint32_t  PROGCHPUMP;                   /*!< (@ 0x00000008) Program charge pump current                                */
  __IOM uint32_t  VCOTRIM;                      /*!< (@ 0x0000000C) VCO trim value for the 64 MHz PLL                          */
  __IOM uint32_t  VCOTRIMOVERRIDE;              /*!< (@ 0x00000010) Control overriding of the VCO trim values                  */
} OSCILLATORS_PLL64M_Type;                      /*!< Size = 20 (0x14)                                                          */


/**
  * @brief REGULATORS_VREGANA [VREGANA] (Unspecified)
  */
typedef struct {
  __IOM uint32_t  VOUT;                         /*!< (@ 0x00000000) Control the output voltage                                 */
  __IOM uint32_t  DCDCEN;                       /*!< (@ 0x00000004) Enable DC/DC operation of the regulator                    */
  __IOM uint32_t  ENFORCEPWRREGMODE;            /*!< (@ 0x00000008) Enable forcing of power mode in power regulator            */
  __IOM uint32_t  FORCEREGMODE;                 /*!< (@ 0x0000000C) Backdoor register for manual selection of power
                                                                    mode                                                       */
  __IM  uint32_t  CURRENTPWRREGMODE;            /*!< (@ 0x00000010) Current mode in the power regulator                        */
  __IOM uint32_t  TESTLOAD;                     /*!< (@ 0x00000014) Test load setting                                          */
  __IOM uint32_t  ULPCAL;                       /*!< (@ 0x00000018) Calibration of ULP regulator                               */
  __IOM uint32_t  DEBUGLVLP;                    /*!< (@ 0x0000001C) Debug register - control spare signals in LVLP             */
  __IM  uint32_t  RESERVED[2];
  __IOM uint32_t  BUCKCALPWM;                   /*!< (@ 0x00000028) TBD                                                        */
  __IM  uint32_t  RESERVED1[5];
  __IOM uint32_t  AVOIDULP;                     /*!< (@ 0x00000040) Backdoor to avoid ULP mode                                 */
} REGULATORS_VREGANA_Type;                      /*!< Size = 68 (0x44)                                                          */


/**
  * @brief REGULATORS_VREGMAIN [VREGMAIN] (Unspecified)
  */
typedef struct {
  __IOM uint32_t  VOUT;                         /*!< (@ 0x00000000) Control the output voltage                                 */
  __IOM uint32_t  ULPALWAYSON;                  /*!< (@ 0x00000004) Keep ULP regulator on at all times                         */
  __IOM uint32_t  ENFORCEPWRREGMODE;            /*!< (@ 0x00000008) Enable forcing of power mode in power regulator            */
  __IOM uint32_t  FORCEREGMODE;                 /*!< (@ 0x0000000C) Backdoor register for manual selection of power
                                                                    mode                                                       */
  __IM  uint32_t  CURRENTPWRREGMODE;            /*!< (@ 0x00000010) Current mode in the power regulator                        */
  __IOM uint32_t  PWRREGICMPTIMER;              /*!< (@ 0x00000014) Control the stay-alive time for the current comparator     */
  __IOM uint32_t  TESTLOAD;                     /*!< (@ 0x00000018) Test load setting                                          */
  __IM  uint32_t  RESERVED;
  __IOM uint32_t  ULPCAL;                       /*!< (@ 0x00000020) Calibration of ULP regulator                               */
  __IOM uint32_t  ULPICMPCAL;                   /*!< (@ 0x00000024) Calibration of current comparator on ULP regulator         */
  __IOM uint32_t  BYPASS;                       /*!< (@ 0x00000028) Bypass control                                             */
} REGULATORS_VREGMAIN_Type;                     /*!< Size = 44 (0x2c)                                                          */


/**
  * @brief RADIO_DEBUGPSEL [DEBUGPSEL] (Unspecified)
  */
typedef struct {
  __IOM uint32_t  CLOCK;                        /*!< (@ 0x00000000) Pin select for RADIO clock (direct mode, base
                                                                    band debug. Refer to digip_064 and digip_061,
                                                                    txCk and ckDataIn signals)                                 */
  __IOM uint32_t  DATA;                         /*!< (@ 0x00000004) Pin select for RADIO data (direct mode, base
                                                                    band debug. Refer to digip_064 and digip_061,
                                                                    txRadioData and dataIn signals)                            */
} RADIO_DEBUGPSEL_Type;                         /*!< Size = 8 (0x8)                                                            */


/**
  * @brief RADIO_PSEL [PSEL] (Unspecified)
  */
typedef struct {
  __IOM uint32_t  DFEGPIO[8];                   /*!< (@ 0x00000000) Description collection: Pin select for DFE pin
                                                                    n                                                          */
} RADIO_PSEL_Type;                              /*!< Size = 32 (0x20)                                                          */


/**
  * @brief RADIO_DFEPACKET [DFEPACKET] (DFE packet EasyDMA channel)
  */
typedef struct {
  __IOM uint32_t  PTR;                          /*!< (@ 0x00000000) Data pointer                                               */
  __IOM uint32_t  MAXCNT;                       /*!< (@ 0x00000004) Maximum number of buffer words to transfer                 */
  __IM  uint32_t  AMOUNT;                       /*!< (@ 0x00000008) Number of samples transferred in the last transaction      */
} RADIO_DFEPACKET_Type;                         /*!< Size = 12 (0xc)                                                           */


/**
  * @brief RADIO_ACQDMA [ACQDMA] (EasyDMA channel for data acquisition (refer to 4378_164))
  */
typedef struct {
  __IOM uint32_t  PTR;                          /*!< (@ 0x00000000) EasyDMA pointer for data acquisition (refer to
                                                                    4378_164)                                                  */
  __IOM uint32_t  MAXCNT;                       /*!< (@ 0x00000004) Maximum number of 32-bit words to transfer (refer
                                                                    to 4378_164)                                               */
  __IM  uint32_t  AMOUNT;                       /*!< (@ 0x00000008) Number of 32-bit words transferred in the last
                                                                    transaction (refer to 4378_164)                            */
} RADIO_ACQDMA_Type;                            /*!< Size = 12 (0xc)                                                           */


/**
  * @brief GPIOTE_TASKS_PCPPEN [TASKS_PCPPEN] (Peripheral tasks.)
  */
typedef struct {
  __OM  uint32_t  LOW;                          /*!< (@ 0x00000000) Description cluster: Configure PCP[n] requests
                                                                    to have lowest possible penalty                            */
  __OM  uint32_t  HIGH;                         /*!< (@ 0x00000004) Description cluster: Configure PCP[n] requests
                                                                    to have highest possible penalty                           */
} GPIOTE_TASKS_PCPPEN_Type;                     /*!< Size = 8 (0x8)                                                            */


