adamkondraciuk/hal_nordic/nrfx/mdk/nrf5001.h
typedef struct {                                /*!< (@ 0x40022000) VMC Structure                                              */
  __IM  uint32_t  RESERVED[384];
  __IOM VMC_RAM_Type RAM[2];                    /*!< (@ 0x00000600) Unspecified                                                */
} NRF_VMC_Type;                                 /*!< Size = 1568 (0x620)                                                       */



/* =========================================================================================================================== */
/* ================                                           NVMC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Non Volatile Memory Controller (NVMC)
  */

typedef struct {                                /*!< (@ 0x40023000) NVMC Structure                                             */
  __IM  uint32_t  RESERVED[256];
  __IM  uint32_t  READY;                        /*!< (@ 0x00000400) Ready flag                                                 */
  __IM  uint32_t  RESERVED1;
  __IM  uint32_t  READYNEXT;                    /*!< (@ 0x00000408) Ready flag                                                 */
  __IM  uint32_t  TESTWORDSTATE;                /*!< (@ 0x0000040C) Test word status                                           */
  __IM  uint32_t  RESERVED2[61];
  __IOM uint32_t  CONFIG;                       /*!< (@ 0x00000504) Configuration register                                     */
  __OM  uint32_t  ERASEPAGE;                    /*!< (@ 0x00000508) Register for erasing a page in code area                   */
  __OM  uint32_t  ERASEALL;                     /*!< (@ 0x0000050C) Register for erasing all non-volatile user memory          */
  __IM  uint32_t  RESERVED3;
  __OM  uint32_t  ERASEUICR;                    /*!< (@ 0x00000514) Register for erasing whole UICR page                       */
  __IM  uint32_t  RESERVED4[6];
  __IOM uint32_t  WAITSTATENUM;                 /*!< (@ 0x00000530) Register to set the number of wait-state for
                                                                    non-volatile memory access. To update the
                                                                    WAITSTATENUM field, the ACCESSCODE must
                                                                    be correct.                                                */
  __OM  uint32_t  TESTWORD;                     /*!< (@ 0x00000534) Test the programming state of the least significant
                                                                    bit in a word                                              */
  __IM  uint32_t  RESERVED5[10];
  __IOM uint32_t  VSELREAD;                     /*!< (@ 0x00000560) Select output voltage of power generator for
                                                                    read mode                                                  */
  __IOM uint32_t  VSELWRITE;                    /*!< (@ 0x00000564) Select output voltage of power generator for
                                                                    write mode                                                 */
  __IOM uint32_t  VSELERASE;                    /*!< (@ 0x00000568) Select output voltage of power generator for
                                                                    erase mode                                                 */
  __IM  uint32_t  RESERVED6[37];
  __IOM uint32_t  TESTMODE;                     /*!< (@ 0x00000600) Register for entering test mode. Refer to the
                                                                    MTP IP test documentation for more details.                */
  __IM  uint32_t  RESERVED7[3];
  __OM  uint32_t  TESTMASSERASE;                /*!< (@ 0x00000610) Self-timed mass-erase operation                            */
  __IM  uint32_t  RESERVED8[3];
  __IOM uint32_t  TESTDATA128[2];               /*!< (@ 0x00000620) Description collection: Direct MTP test data
                                                                    word n                                                     */
  __IM  uint32_t  RESERVED9[2];
  __IM  uint32_t  TESTDATA128INC[2];            /*!< (@ 0x00000630) Description collection: Direct MTP test data
                                                                    word n. Post-increments TESTCONTROLADDR                    */
  __IM  uint32_t  RESERVED10[2];
  __IM  uint32_t  TESTCMPINC;                   /*!< (@ 0x00000640) Reads and compares last MTP row to TESTDATA128
                                                                    content. Post-increments TESTCONTROLADDR.                  */
  __IM  uint32_t  TESTNCMPINC;                  /*!< (@ 0x00000644) Reads and compares last MTP row to complement
                                                                    of TESTDATA128 content. Post-increments
                                                                    TESTCONTROLADDR.                                           */
  __IOM uint32_t  TESTCONTROLLINES;             /*!< (@ 0x00000648) Direct MTP test, control lines. Refer to the
                                                                    MTP IP documentation for more details.                     */
  __IOM uint32_t  TESTCONTROLADDR;              /*!< (@ 0x0000064C) Direct MTP test control, address lines                     */
  __IOM uint32_t  TESTCOUNTERRELOAD;            /*!< (@ 0x00000650) Counter reload value, used when counting from
                                                                    CE rising edge to latching of data                         */
  __IM  uint32_t  TESTCOUNTERRUNNING;           /*!< (@ 0x00000654) Returns the state (counting or not) of the counter         */
  __IOM uint32_t  TESTCONFIG;                   /*!< (@ 0x00000658) Mode of operation of the counter                           */
  __IOM uint32_t  TESTMEASVPPEN;                /*!< (@ 0x0000065C) Controls analog signals for MTP measurements               */
  __IOM uint32_t  TESTPOWERCONTROL;             /*!< (@ 0x00000660) Direct test, control lines to the MTP power generator
                                                                    module. Refer to the MTP IP documentation
                                                                    for more details.                                          */
  __IM  uint32_t  RESERVED11[39];
  __IOM uint32_t  FORCEONNVM;                   /*!< (@ 0x00000700) Force on NVM supply                                        */
  __IM  uint32_t  RESERVED12[9];
  __IOM uint32_t  FORCEOFFNVM;                  /*!< (@ 0x00000728) Force off NVM supply                                       */
} NRF_NVMC_Type;                                /*!< Size = 1836 (0x72c)                                                       */



/* =========================================================================================================================== */
/* ================                                           BPROT                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Block Protect (BPROT)
  */

typedef struct {                                /*!< (@ 0x40024000) BPROT Structure                                            */
  __IM  uint32_t  RESERVED[384];
  __IOM uint32_t  CONFIG0;                      /*!< (@ 0x00000600) Block protect configuration register 0                     */
  __IOM uint32_t  CONFIG1;                      /*!< (@ 0x00000604) Block protect configuration register 1                     */
  __IOM uint32_t  DISABLEINDEBUG;               /*!< (@ 0x00000608) Disable protection mechanism in debug mode                 */
} NRF_BPROT_Type;                               /*!< Size = 1548 (0x60c)                                                       */



/* =========================================================================================================================== */
/* ================                                         RAMBIST0                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief The RamBist perform hardware accelerated RAM tests 0 (RAMBIST0)
  */

typedef struct {                                /*!< (@ 0x40025000) RAMBIST0 Structure                                         */
  __IM  uint32_t  RESERVED[256];
  __IOM RAMBIST_STATUS_Type STATUS;             /*!< (@ 0x00000400) Unspecified                                                */
  __IM  uint32_t  RESERVED1[62];
  __IOM uint32_t  RUN;                          /*!< (@ 0x00000500) Run the BIST engine, must be kept 1 until the
                                                                    BIST is finished                                           */
  __IOM RAMBIST_CONFIG_Type CONFIG;             /*!< (@ 0x00000504) Unspecified                                                */
} NRF_RAMBIST_Type;                             /*!< Size = 1296 (0x510)                                                       */



/* =========================================================================================================================== */
/* ================                                         RCOSC32K                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief 32.768 kHz RC oscillator (RCOSC32K)
  */

typedef struct {                                /*!< (@ 0x40027000) RCOSC32K Structure                                         */
  __OM  uint32_t  TASKS_CAL;                    /*!< (@ 0x00000000) Start calibration of LFRC oscillator                       */
  __OM  uint32_t  TASKS_CTSTART;                /*!< (@ 0x00000004) Deprecated register - Start calibration timer              */
  __OM  uint32_t  TASKS_CTSTOP;                 /*!< (@ 0x00000008) Deprecated register - Stop calibration timer               */
  __IM  uint32_t  RESERVED[29];
  __IOM uint32_t  SUBSCRIBE_CAL;                /*!< (@ 0x00000080) Subscribe configuration for task CAL                       */
  __IOM uint32_t  SUBSCRIBE_CTSTART;            /*!< (@ 0x00000084) Deprecated register - Subscribe configuration
                                                                    for task CTSTART                                           */
  __IOM uint32_t  SUBSCRIBE_CTSTOP;             /*!< (@ 0x00000088) Deprecated register - Subscribe configuration
                                                                    for task CTSTOP                                            */
  __IM  uint32_t  RESERVED1[29];
  __IOM uint32_t  EVENTS_CTTO;                  /*!< (@ 0x00000100) Deprecated register - Calibration timer timeout            */
  __IOM uint32_t  EVENTS_DONE;                  /*!< (@ 0x00000104) Calibration of LFCLK RC oscillator complete event          */
  __IOM uint32_t  EVENTS_CTSTARTED;             /*!< (@ 0x00000108) Deprecated register - Calibration timer started            */
  __IOM uint32_t  EVENTS_CTSTOPPED;             /*!< (@ 0x0000010C) Deprecated register - Calibration timer stopped            */
  __IM  uint32_t  RESERVED2[28];
  __IOM uint32_t  PUBLISH_CTTO;                 /*!< (@ 0x00000180) Deprecated register - Publish configuration for
                                                                    event CTTO                                                 */
  __IOM uint32_t  PUBLISH_DONE;                 /*!< (@ 0x00000184) Publish configuration for event DONE                       */
  __IOM uint32_t  PUBLISH_CTSTARTED;            /*!< (@ 0x00000188) Deprecated register - Publish configuration for
                                                                    event CTSTARTED                                            */
  __IOM uint32_t  PUBLISH_CTSTOPPED;            /*!< (@ 0x0000018C) Deprecated register - Publish configuration for
                                                                    event CTSTOPPED                                            */
  __IM  uint32_t  RESERVED3[164];
  __IM  uint32_t  RCOSC32KIFINE;                /*!< (@ 0x00000420) Fine calibration read value for 32.768 kHz RC
                                                                    oscillator                                                 */
  __IM  uint32_t  RCOSC32KICOARSE;              /*!< (@ 0x00000424) Coarse calibration read value for 32.768 kHz
                                                                    RC oscillator                                              */
  __IM  uint32_t  RESERVED4[67];
  __IOM uint32_t  RCOSC32KICALTEST;             /*!< (@ 0x00000534) 32.768 kHz RC oscillator calibration debug register
                                                                    NOTE: This register should not be written
                                                                    to while the RCOSC source is running.                      */
  __IOM uint32_t  CTIV;                         /*!< (@ 0x00000538) Deprecated register - Calibration timer interval
                                                                    NOTE: This register should not be written
                                                                    to while the calibration timer is running.                 */
  __IOM uint32_t  RCOSC32KICALLENGTH;           /*!< (@ 0x0000053C) 32kHz RC oscillator calibration length This value
                                                                    is read from FICR                                          */
  __IOM uint32_t  RCOSC32KICOARSEIN;            /*!< (@ 0x00000540) RCOSC coarse calibration input This value is
                                                                    read from FICR                                             */
  __IM  uint32_t  RESERVED5[2];
  __IOM uint32_t  RCOSC32KICABD;                /*!< (@ 0x0000054C) Comparator adaptive biasing disable                        */
  __IM  uint32_t  RESERVED6[13];
  __IOM uint32_t  ATECLOCK;                     /*!< (@ 0x00000584) Analog test bus control for clock modules                  */
  __IM  uint32_t  RESERVED7[11];
  __IOM uint32_t  LFRCMODE;                     /*!< (@ 0x000005B4) LFRC mode configuration                                    */
  __IOM uint32_t  LFULP32KICOARSEIN;            /*!< (@ 0x000005B8) Deprecated register - LFULP coarse calibration
                                                                    input This value is read from FICR                         */
  __IOM uint32_t  LFULP32KICALLENGTH;           /*!< (@ 0x000005BC) Deprecated register - 32kHz LFULP RC oscillator
                                                                    calibration length This value is read from
                                                                    FICR                                                       */
  __IM  uint32_t  RESERVED8[399];
  __IOM uint32_t  DISABLERCOSC32KIPOWERUPCONTROL;/*!< (@ 0x00000BFC) Backdoor for disabling Rcosc32KiPowerUpControl
                                                                    module in Rcosc32KiGenerator.                              */
} NRF_RCOSC32K_Type;                            /*!< Size = 3072 (0xc00)                                                       */



/* =========================================================================================================================== */
/* ================                                      PCGCSLAVE_AMLI                                       ================ */
/* =========================================================================================================================== */


/**
  * @brief PCGCSlave (PCGCSLAVE_AMLI)
  */

typedef struct {                                /*!< (@ 0x41000000) PCGCSLAVE_AMLI Structure                                   */
  __IM  uint32_t  RESERVED[30];
  __IM  uint32_t  TRIGZEROPENALTY;              /*!< (@ 0x00000078) Trigger zero penalty                                       */
  __IM  uint32_t  TRIGFULLPENALTY;              /*!< (@ 0x0000007C) Trigger full penalty                                       */
  __IM  uint32_t  RESERVED1[736];
  __IM  uint32_t  PENALTY[2];                   /*!< (@ 0x00000C00) Description collection: Penalty level for power/clock
                                                                    pair n                                                     */
  __IM  uint32_t  RESERVED2[30];
  __IM  uint32_t  FORCEOVERRIDE[2];             /*!< (@ 0x00000C80) Description collection: Force override of power/clock
                                                                    pair n                                                     */
} NRF_PCGCSLAVE_Type;                           /*!< Size = 3208 (0xc88)                                                       */



/* =========================================================================================================================== */
/* ================                                        PCGCMASTER0                                        ================ */
/* =========================================================================================================================== */


/**
  * @brief PCGC Master (PCGCMASTER0)
  */

