adamkondraciuk/hal_nordic/nrfx/mdk/nrf5001.h
/** @addtogroup Device_Peripheral_peripheralAddr
  * @{
  */

#define NRF_FICR_BASE               0x10000000UL
#define NRF_UICR_BASE               0x10001000UL
#define NRF_PAMLI_BASE              0x40020000UL
#define NRF_VMC_BASE                0x40022000UL
#define NRF_NVMC_BASE               0x40023000UL
#define NRF_BPROT_BASE              0x40024000UL
#define NRF_RAMBIST0_BASE           0x40025000UL
#define NRF_RAMBIST1_BASE           0x40026000UL
#define NRF_RCOSC32K_BASE           0x40027000UL
#define NRF_PCGCSLAVE_AMLI_BASE     0x41000000UL
#define NRF_PCGCMASTER0_BASE        0x41001000UL
#define NRF_CLOCK_BASE              0x40000000UL
#define NRF_POWER_BASE              0x40000000UL
#define NRF_RESET_BASE              0x40000000UL
#define NRF_AMLI_BASE               0x41000000UL
#define NRF_P0_BASE                 0x50000000UL
#define NRF_P1_BASE                 0x50000300UL
#define NRF_OSCILLATORS_BASE        0x40001000UL
#define NRF_REGULATORS_BASE         0x40001000UL
#define NRF_RADIO_BASE              0x40002000UL
#define NRF_RNG_BASE                0x40003000UL
#define NRF_GPIOTE_BASE             0x40004000UL
#define NRF_WDT_BASE                0x40005000UL
#define NRF_TIMER0_BASE             0x40006000UL
#define NRF_TIMER1_BASE             0x40007000UL
#define NRF_ECB_BASE                0x40009000UL
#define NRF_AAR_BASE                0x4000A000UL
#define NRF_CCM_BASE                0x4000A000UL
#define NRF_DPPIC_BASE              0x4000B000UL
#define NRF_RTC0_BASE               0x4000C000UL
#define NRF_RTC1_BASE               0x4000D000UL
#define NRF_SPIM0_BASE              0x4000E000UL
#define NRF_SPIS0_BASE              0x4000E000UL
#define NRF_UARTE0_BASE             0x4000E000UL
#define NRF_USBD_BASE               0x40011000UL
#define NRF_QDEC0_BASE              0x40012000UL

/** @} */ /* End of group Device_Peripheral_peripheralAddr */


/* =========================================================================================================================== */
/* ================                                  Peripheral declaration                                   ================ */
/* =========================================================================================================================== */


/** @addtogroup Device_Peripheral_declaration
  * @{
  */

#define NRF_FICR                    ((NRF_FICR_Type*)          NRF_FICR_BASE)
#define NRF_UICR                    ((NRF_UICR_Type*)          NRF_UICR_BASE)
#define NRF_PAMLI                   ((NRF_PAMLI_Type*)         NRF_PAMLI_BASE)
#define NRF_VMC                     ((NRF_VMC_Type*)           NRF_VMC_BASE)
#define NRF_NVMC                    ((NRF_NVMC_Type*)          NRF_NVMC_BASE)
#define NRF_BPROT                   ((NRF_BPROT_Type*)         NRF_BPROT_BASE)
#define NRF_RAMBIST0                ((NRF_RAMBIST_Type*)       NRF_RAMBIST0_BASE)
#define NRF_RAMBIST1                ((NRF_RAMBIST_Type*)       NRF_RAMBIST1_BASE)
#define NRF_RCOSC32K                ((NRF_RCOSC32K_Type*)      NRF_RCOSC32K_BASE)
#define NRF_PCGCSLAVE_AMLI          ((NRF_PCGCSLAVE_Type*)     NRF_PCGCSLAVE_AMLI_BASE)
#define NRF_PCGCMASTER0             ((NRF_PCGCMASTER_Type*)    NRF_PCGCMASTER0_BASE)
#define NRF_CLOCK                   ((NRF_CLOCK_Type*)         NRF_CLOCK_BASE)
#define NRF_POWER                   ((NRF_POWER_Type*)         NRF_POWER_BASE)
#define NRF_RESET                   ((NRF_RESET_Type*)         NRF_RESET_BASE)
#define NRF_AMLI                    ((NRF_AMLI_Type*)          NRF_AMLI_BASE)
#define NRF_P0                      ((NRF_GPIO_Type*)          NRF_P0_BASE)
#define NRF_P1                      ((NRF_GPIO_Type*)          NRF_P1_BASE)
#define NRF_OSCILLATORS             ((NRF_OSCILLATORS_Type*)   NRF_OSCILLATORS_BASE)
#define NRF_REGULATORS              ((NRF_REGULATORS_Type*)    NRF_REGULATORS_BASE)
#define NRF_RADIO                   ((NRF_RADIO_Type*)         NRF_RADIO_BASE)
#define NRF_RNG                     ((NRF_RNG_Type*)           NRF_RNG_BASE)
#define NRF_GPIOTE                  ((NRF_GPIOTE_Type*)        NRF_GPIOTE_BASE)
#define NRF_WDT                     ((NRF_WDT_Type*)           NRF_WDT_BASE)
#define NRF_TIMER0                  ((NRF_TIMER_Type*)         NRF_TIMER0_BASE)
#define NRF_TIMER1                  ((NRF_TIMER_Type*)         NRF_TIMER1_BASE)
#define NRF_ECB                     ((NRF_ECB_Type*)           NRF_ECB_BASE)
#define NRF_AAR                     ((NRF_AAR_Type*)           NRF_AAR_BASE)
#define NRF_CCM                     ((NRF_CCM_Type*)           NRF_CCM_BASE)
#define NRF_DPPIC                   ((NRF_DPPIC_Type*)         NRF_DPPIC_BASE)
#define NRF_RTC0                    ((NRF_RTC_Type*)           NRF_RTC0_BASE)
#define NRF_RTC1                    ((NRF_RTC_Type*)           NRF_RTC1_BASE)
#define NRF_SPIM0                   ((NRF_SPIM_Type*)          NRF_SPIM0_BASE)
#define NRF_SPIS0                   ((NRF_SPIS_Type*)          NRF_SPIS0_BASE)
#define NRF_UARTE0                  ((NRF_UARTE_Type*)         NRF_UARTE0_BASE)
#define NRF_USBD                    ((NRF_USBD_Type*)          NRF_USBD_BASE)
#define NRF_QDEC0                   ((NRF_QDEC_Type*)          NRF_QDEC0_BASE)

/** @} */ /* End of group Device_Peripheral_declaration */


#ifdef __cplusplus
}
#endif

#endif /* NRF5001_H */


/** @} */ /* End of group nrf5001 */

/** @} */ /* End of group Nordic Semiconductor */
